<?php

return array(
    'error_message' => array(
        '0'     => '操作成功',
        '10000' => '系统异常',
        '10001' => '请求类型错误',
        '10002' => '验证类不存在',
        '10003' => 'sign 不能为空',
        '10004' => 'sign 长度有误',
        '10005' => 'timestamp 不能为空',
        '10006' => 'timestamp 类型有误',
        '10007' => 'nonce 不能为空',
        '10008' => 'nonce 长度有误',
        '10009' => 'nonce 类型有误',
        '10010' => 'timestamp 过期',
        '10011' => 'nonce 已经存在',
        '10012' => 'sign 有误',
        '10013' => '校验模块配置文件不存在',
        '10014' => '验证控制器不存在',
        '10015' => '验证方法不存在',
        '10016' => '过滤器 key 不存在',
        '10017' => '过滤方法不存在',
        '10018' => '过滤方法数量不足',
        '10019' => '令牌桶 key 不存在',
    ),
);